# -*- coding: utf-8 -*-
import random
import urllib
from bs4 import BeautifulSoup

name_list = []


def get_name(url):
    headers = {'User-Agent': 'Mozilla/5.0 3578.98 Safari/537.36'}
    request = urllib.request.Request(url, headers=headers)  # 创建对名字大全网站get请求
    result = urllib.request.urlopen(request)  # 发出请求
    soup = BeautifulSoup(result.read(), 'html.parser')  # 生成可分析对象
    if soup.find_all("a", class_="btn btn2"):
        for name in soup.find_all("a", class_="btn btn2")[:70]:  # 遍历所有的姓氏链接，此处只获取前15个姓氏
            url = 'http:' + name.attrs['href']  # 找到姓氏链接，再次返回此函数
            get_name(url)
    elif soup.find_all('a', class_='btn btn-link'):
        for name in soup.find_all('a', class_='btn btn-link')[:10]:  # 找到不同姓氏的名字，此处只获取每个姓氏的前10个
            name_list.append(name.text)
            # print name.text

    return name_list


if __name__ == '__main__':
    url = "http://www.resgain.net/xsdq.html"
    a = get_name(url)
    print(a)

nameList = ['赵邦斌', '赵庆昌', '赵昆', '赵晓', '赵东平', '赵翥', '赵西华', '赵羾', '赵务联', '赵福盛', '钱韦杉', '钱允中', '钱山帘', '钱渊', '钱婧', '钱国梁',
            '钱宏才', '钱惟演', '钱福星', '钱正英', '孙氏', '孙纬', '孙思邈', '孙楠', '孙云锦', '孙树本', '孙润华', '孙光', '孙用', '孙敬修', '李俊', '李光洁',
            '李嘉欣', '李彩桦', '李凉', '李思捷', '李灿森', '李保田', '李继耐', '李丽珍', '周氏', '周涌', '周孝坤', '周传雄', '周培源', '周作人', '周厚健', '周来祥',
            '周卓茹', '周之煌', '吴仪', '吴珑', '吴晗', '吴大鸡', '吴铎', '吴宇森', '吴西', '吴祖光', '吴学谦', '吴浩康', '郑位三', '郑敏', '郑慕倩', '郑光华',
            '郑国仲', '郑绪岚', '郑洪业', '郑小瑛', '郑宝仁', '郑光武', '王紫娇', '王栋隆', '王小丫', '王近山', '王容', '王文通', '王宽诚', '王进喜', '王文德',
            '王培根', '冯玉祥', '冯梯云', '冯媛甄', '冯白驹', '冯骥', '冯德培', '冯钢百', '冯国勤', '冯雪峰', '冯志超', '陈乔恩', '陈毅', '陈世炬', '陈数', '陈浩',
            '陈自瑶', '陈紫涵', '陈佩斯', '陈楚生', '陈明仁', '褚凤岐', '褚朝阳', '褚应璜', '褚传禹', '褚遂良', '褚载', '褚天洪', '褚振民', '褚圣麟', '褚君浩',
            '卫姓', '卫中正', '卫玠', '卫兰', '卫宗武', '卫祖荫', '卫广发', '卫仁近', '卫之民', '卫永清', '蒋氏', '蒋大为', '蒋立镛', '蒋经国', '蒋雯丽', '蒋学道',
            '蒋梦麟', '蒋勤勤', '蒋齐生', '蒋焘', '沈柏年', '沈君玉', '沈嘉', '沈尹默', '沈小芳', '沈绪榜', '沈傲君', '沈贤修', '沈廷文', '沈恒吉', '韩雪', '韩有文',
            '韩璐', '韩启民', '韩增', '韩偓', '韩伟', '韩垂', '韩其为', '韩说', '杨尚昆', '杨之炯', '杨传堂', '杨童舒', '杨思敏', '杨谏', '杨洁篪', '杨丞琳',
            '杨谨华', '杨宗磐', '朱鎔基', '朱高炽', '朱琳', '朱治登', '朱凯婷', '朱彝', '朱子奇', '朱慧珍', '朱哲琴', '朱光', '秦化龙', '秦裕琨', '秦海璐', '秦家泰',
            '秦韬玉', '秦觏', '秦一爵', '秦兆阳', '秦毅丰', '秦鹤龄', '尤太忠', '尤萃', '尤袤', '尤子平', '尤家骏', '尤扬祖', '尤有中', '尤英', '尤阴', '尤犀杯',
            '许冠杰', '许世英', '许文益', '许德瑗', '许永跃', '许少鸿', '许忠民', '许林枫', '许淑瑛', '许征帆', '何炅', '何国钟', '何德庆', '何家劲', '何振梁',
            '何英', '何瑞荣', '何厚铧', '何文今', '何美钿', '吕晶晶', '吕恩谊', '吕庆风', '吕文成', '吕远', '吕志先', '吕同老', '吕茂堂', '吕剑人', '吕作松',
            '施性谋', '施氏', '施心傅', '施霖', '施振眉', '施艳飞', '施正荣', '施乃良', '施仲衡', '施履吉', '张雨绮', '张耀扬', '张治中', '张庭', '张云川', '张作霖',
            '张恩照', '张达明', '张静初', '张涵予', '孔伯明', '孔继荣', '孔宪涛', '孔宪彝', '孔瑜', '孔令奇', '孔丘', '孔继绪', '孔莹', '孔庆德', '曹刚川', '曹方',
            '曹敏莉', '曹龙', '曹锟', '曹丕', '曹维廉', '曹广化', '曹晨涛', '曹格', '严复', '严克强', '严宏谟', '严蕊', '严宽', '严公弼', '严灏景', '严仁',
            '严开元', '严学群', '华人琴', '华世芳', '华氏', '华三川', '华罗庚', '华歆', '华清', '华谭', '华恩', '华大成', '金伯雄', '金龙节', '金史', '金士龙',
            '金兆梓', '金逸', '金古良', '金琏', '金世元', '金星', '魏氏', '魏征', '魏洪亮', '魏琳', '魏震五', '魏毓麟', '魏容', '魏夫人', '魏兆琛', '魏永',
            '陶虹', '陶大钊', '陶煜', '陶爱英', '陶鼎', '陶澍', '陶立中', '陶菲克', '陶焘', '陶珙', '姜君辰', '姜胜玲', '姜秀珍', '姜泓', '姜维汉', '姜夔',
            '姜以立', '姜泗长', '姜有庆', '姜时俊', '戚烈云', '戚继光', '戚美珍', '戚学标', '戚单', '戚纶', '戚惊萱', '戚正武', '戚元德', '戚元靖', '谢世楞', '谢添',
            '谢高忠', '谢君绩', '谢应芳', '谢汲', '谢甫生', '谢颖苏', '谢克昌', '谢介子', '邹庚壬', '邹瑜', '邹氏', '邹忠', '邹善芳', '邹衍', '邹仲彝', '邹树春',
            '邹尔康', '邹文怀', '喻屏', '喻传鉴', '喻继高', '喻培伦', '喻杰', '喻忠桂', '喻德渊', '喻雨初', '喻坦之', '喻凫', '柏雪', '柏拉图', '柏子庭', '柏立本',
            '柏俞龄', '柏盟鸥', '柏妍安', '柏青', '柏扬', '柏克寒', '水均益', '水桓', '水同天', '水新元', '水华', '水思中', '水神', '水江览', '水皮', '业务联系',
            '窦智孔', '窦瑞华', '窦唯', '窦洵直', '窦遴奇', '窦皇后', '窦遵', '窦叔向', '窦朝荣', '窦章', '章子怡', '章猛进', '章镗', '章训', '章继伯', '章学诚',
            '章公美', '章均赛', '章岩', '章辰', '云曙芬', '云铎', '云燕铭', '云世英', '云秀梅', '云照光', '云广英', '云布龙', '云公民', '苏振华', '苏荣',
            '苏武功', '苏氏', '苏殿选', '苏士墉', '苏辙', '苏张', '苏三懋', '苏肇冰', '潘佩芳', '潘唐', '潘正涛', '潘存实', '潘垣', '潘逸阳', '潘冰蟾', '潘承烈',
            '潘山痴', '潘义清', '葛旭初', '葛佩琦', '葛优', '葛曦', '葛云飞', '葛鸦儿', '葛庭燧', '葛天民', '葛渠', '葛云彬', '奚元朗', '奚吴', '奚业胜', '奚颖文',
            '奚超', '奚静之', '奚震', '奚曾坫', '奚元龄', '奚福泉', '范仲淹', '范鸿简', '范从振', '范理', '范希贤', '范超', '范鼎', '范行准', '范守中', '范钧宏',
            '彭士禄', '彭心宜', '彭真', '彭久洋', '彭敏', '彭园春', '彭德清', '彭迪先', '彭桓武', '彭华秀', '郎朗', '郎世宁', '郎世俊', '郎福延', '郎余令', '郎士元',
            '郎静山', '郎绍安', '郎平', '郎瑞', '鲁仙圃', '鲁如坤', '鲁宗镐', '鲁建', '鲁加汉', '鲁德馨', '鲁琦', '鲁大东', '鲁志强', '鲁静', '韦力', '韦江凡',
            '韦氏', '韦东', '韦家能', '韦昌辉', '韦应物', '韦安石', '韦式', '韦启美', '昌显', '昌泰', '业务联系', '打赏支持', '提建议', '万年历', '马国良', '马英九',
            '马定国', '马伊俐', '马立凯', '马力', '马森', '马朴', '马启智', '马福康', '苗永明', '苗侨伟', '苗乙乙', '苗海忠', '苗丕一', '苗竹贤', '苗逢澍', '苗振华',
            '苗春亭', '苗振宇', '凤臣', '凤来仪', '凤洲', '凤池', '凤栖', '业务联系', '打赏支持', '提建议', '万年历', '花榜', '花士良', '花纯儒', '花淑兰', '花沙讷',
            '花成', '花月仙', '花欣', '花茂', '业务联系', '方永刚', '方嘉德', '方兆祥', '方福林', '方静', '方药如', '方崖', '方筠', '方孝孺', '方心芳', '俞仁夫',
            '俞凤喈', '俞纲', '俞林', '俞福良', '俞海潮', '俞彬', '俞霭峰', '俞创硕', '俞鸿钧', '任新民', '任泽民', '任傑', '任弼时', '任德耀', '任国栋', '任氏',
            '任廷桂', '任元玮', '任昌', '袁世凯', '袁子钦', '袁咏仪', '袁耀发', '袁木', '袁宏', '袁子昂', '袁惟仁', '袁炜', '袁丽云', '柳永', '柳宗直', '柳随年',
            '柳真保', '柳公绰', '柳道伦', '柳泌', '柳蕴兰', '柳云龙', '柳念曾', '酆云鹤', '业务联系', '打赏支持', '提建议', '万年历', '鲍振西', '鲍文奎', '鲍廷钰',
            '鲍鉴', '鲍奇辰', '鲍娄先', '鲍培忠', '鲍莹', '鲍先志', '鲍幼文', '史怀璧', '史清盛', '史玉林', '史念祖', '史元厚', '史璋', '史浩', '史玉孝', '史若虚',
            '史佚', '唐铎', '唐子安', '唐自杰', '唐巽泽', '唐诗咏', '唐笑', '唐明', '唐槐秋', '唐庚', '唐麒', '费正', '费玉清', '费俊龙', '费启能', '费新我',
            '费以复', '费雪', '费声福', '费寿康', '费广泰', '廉受文', '廉希贡', '廉仲', '廉孚', '廉布', '廉简', '廉女贞', '廉小强', '业务联系', '打赏支持', '岑维休',
            '岑丙炎', '岑文本', '岑可法', '岑安卿', '岑渊', '岑羲', '岑俊', '岑范', '岑宗旦', '薛凯琪', '薛承让', '薛鸣球', '薛筱卿', '薛涵', '薛真', '薛综',
            '薛宣', '薛曜', '薛氏', '雷凯欣', '雷啸霖', '雷阳', '雷清泉', '雷天觉', '雷宝森', '雷行', '雷兴翰', '雷鸣球', '雷应春', '贺炳炎', '贺健', '贺知章',
            '贺裳', '贺志华', '贺光华', '贺循', '贺晋年', '贺吉祥', '贺耀祖']


def randomName():
    getNameSize = nameList.__len__()
    getName = nameList[random.randint(0, getNameSize)]
    return getName
